{"<|Woman-Yelling-At-Cat|>": 50257, "<|Surprised-Pikachu|>": 50258, "<|Two-Buttons|>": 50259, "<|Blank-Nut-Button|>": 50260, "<|Distracted-Boyfriend|>": 50261, "<|Tuxedo-Winnie-The-Pooh|>": 50262, "<|Running-Away-Balloon|>": 50263, "<|Spongebob-Ight-Imma-Head-Out|>": 50264, "<|American-Chopper-Argument|>": 50265, "<|Oprah-You-Get-A|>": 50266, "<|Hide-the-Pain-Harold|>": 50267, "<|Is-This-A-Pigeon|>": 50268, "<|Inhaling-Seagull|>": 50269, "<|Unsettled-Tom|>": 50270, "<|Evil-Kermit|>": 50271, "<|Hard-To-Swallow-Pills|>": 50272, "<|Expanding-Brain|>": 50273, "<|Change-My-Mind|>": 50274, "<|Mocking-Spongebob|>": 50275, "<|Drake-Hotline-Bling|>": 50276, "<|Epic-Handshake|>": 50277, "<|But-Thats-None-Of-My-Business|>": 50278, "<|Me-And-The-Boys|>": 50279, "<|This-Is-Where-Id-Put-My-Trophy-If-I-Had-One|>": 50280, "<|Well-Yes-But-Actually-No|>": 50281, "<|Imagination-Spongebob|>": 50282, "<|Put-It-Somewhere-Else-Patrick|>": 50283, "<|Arthur-Fist|>": 50284, "<|Left-Exit-12-Off-Ramp|>": 50285, "<|Batman-Slapping-Robin|>": 50286, "<|Boardroom-Meeting-Suggestion|>": 50287, "<|Roll-Safe-Think-About-It|>": 50288, "<|Dr-Evil-Laser|>": 50289, "<|Mr-Krabs-Blur-Meme|>": 50290, "<|Bird-Box|>": 50291, "<|Its-Not-Going-To-Happen|>": 50292, "<|Ill-Have-You-Know-Spongebob|>": 50293, "<|Waiting-Skeleton|>": 50294, "<|Who-Killed-Hannibal|>": 50295, "<|Futurama-Fry|>": 50296, "<|UNO-Draw-25-Cards|>": 50297, "<|Bernie-I-Am-Once-Again-Asking-For-Your-Support|>": 50298, "<|Monkey-Puppet|>": 50299, "<|Panik-Kalm-Panik|>": 50300, "<|endofbox|>": 50301}